.emacs.d/loader.org
** Agenda and capture templates

#+begin_src emacs-lisp
  (setq org-agenda-files '("~/Dropbox/Apps/MobileOrg/inbox.org"
                           "~/Dropbox/Apps/MobileOrg/notes.org"
                           "~/Dropbox/Apps/MobileOrg/gtd.org"
                           "~/Dropbox/Apps/MobileOrg/_Goals.org"
                           "~/Dropbox/Apps/MobileOrg/tickler.org"
                           "~/Dropbox/Apps/MobileOrg/gcal-NOVI.org"
                           "~/Dropbox/Apps/MobileOrg/gcal-Arjen.org"))

  (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                 (file+headline "~/Dropbox/Apps/MobileOrg/inbox.org" "Tasks")
                                 "* TODO %i%?")
                                ("T" "Tickler" entry
                                 (file+headline "~/Dropbox/Apps/MobileOrg/tickler.org" "Tickler")
                                 "* %i%? \n %U")
                                ("e" "email" entry (file+headline "~/Dropbox/Apps/MobileOrg/inbox.org" "Tasks from Email")
                                 "* TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")))

  (setq org-refile-targets '(("~/Dropbox/Apps/MobileOrg/notes.org" :level . 2)
                             ("~/Dropbox/Apps/MobileOrg/tickler.org" :maxlevel . 2)))

  (setq org-agenda-custom-commands
        '(("b" "Build fun things" tags-todo "@bft"
           ((org-agenda-overriding-header "BuildFunThings")
            (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))))

  (defun my-org-agenda-skip-all-siblings-but-first ()
    "Skip all but the first non-done entry."
    (let (should-skip-entry)
      (unless (org-current-is-todo)
        (setq should-skip-entry t))
      (save-excursion
        (while (and (not should-skip-entry) (org-goto-sibling t))
          (when (org-current-is-todo)
            (setq should-skip-entry t))))
      (when should-skip-entry
        (or (outline-next-heading)
            (goto-char (point-max))))))

  (defun org-current-is-todo ()
    (string= "TODO" (org-get-todo-state)))
#+end_src

** Keybindings

#+begin_src emacs-lisp
  (global-set-key "\C-cl" 'org-store-link)
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-cc" 'org-capture)
  (global-set-key "\C-cb" 'org-iswitchb)
#+end_src

** Publishing

*** Packages

#+begin_src emacs-lisp
  (require 'ox-html)
  (require 'ox-publish)


  (use-package htmlize
    :ensure t)

  (add-to-list 'load-path (expand-file-name (concat init-dir "ox-rss")))
  (require 'ox-rss)

#+end_src

A first attempt at a website structure with org-mode. The idea is to build my tutorial website, buildfunthings.com, from these static files.

- [[https://www.brautaset.org/articles/2017/blogging-with-org-mode.html][Reference 1]]

*** Variables

#+begin_src emacs-lisp
  (setq org-mode-websrc-directory "~/Dropbox/Apps/MobileOrg/website")
  (setq org-mode-publishing-directory "~/Dropbox/Apps/MobileOrg/website/_site")

  (setq org-html-htmlize-output-type 'css)

#+end_src

*** Support functions

#+begin_src emacs-lisp
  (defun my-org-export-format-drawer (name content)
    (concat "<div class=\"drawer " (downcase name) "\">\n"
            "<h6>" (capitalize name) "</h6>\n"
            content
            "\n</div>"))
  (setq org-html-format-drawer-function 'my-org-export-format-drawer)

  (defun org-mode-blog-preamble (options)
    "The function that creates the preamble top section for the blog.
              OPTIONS contains the property list from the org-mode export."
    (let ((base-directory (plist-get options :base-directory)))
      (org-babel-with-temp-filebuffer (expand-file-name "top-bar.html" base-directory) (buffer-string))))

  (defun org-mode-blog-postamble (options)
    "The function that creates the postamble, or bottom section for the blog.
              OPTIONS contains the property list from the org-mode export."
    (let ((base-directory (plist-get options :base-directory)))
      (org-babel-with-temp-filebuffer (expand-file-name "bottom.html" base-directory) (buffer-string))))

  (defun org-mode-blog-prepare (options)
    "`index.org' should always be exported so touch the file before publishing."
    (let* (
           (buffer (find-file-noselect (expand-file-name "index.org" org-mode-websrc-directory) t)))
      (with-current-buffer buffer
        (set-buffer-modified-p t)
        (save-buffer 0))
      (kill-buffer buffer)))
#+end_src

*** Publishing configuration

#+begin_src emacs-lisp
  ;; Options: http://orgmode.org/manual/Publishing-options.html
  (setq org-publish-project-alist
        `(("all"
           :components ("site-content" "site-rss" "site-static"))

          ("site-content"
           :base-directory ,org-mode-websrc-directory
           :base-extension "org"
           :publishing-directory ,org-mode-publishing-directory
           :recursive t
           :publishing-function org-html-publish-to-html
           :preparation-function org-mode-blog-prepare

           :html-head "<link rel=\"stylesheet\" href=\"/css/style.css\" type=\"text/css\" />
  <link rel=\"stylesheet\" href=\"/css/all.min.css\" type=\"text/css\" />"

           :headline-levels      4
           :auto-preamble        t
           :auto-postamble       nil
           :auto-sitemap         t
           :sitemap-title        "Build Fun Things"
           :section-numbers      nil
           :table-of-contents    t
           :with-toc             nil
           :with-author          nil
           :with-creator         nil
           :with-tags            nil
           :with-smart-quotes    nil

           :html-doctype         "html5"
           :html-html5-fancy     t
           :html-preamble        org-mode-blog-preamble
           :html-postamble       org-mode-blog-postamble

           :html-head-include-default-style nil
           :html-head-include-scripts nil
           )

          ("site-rss"
           :base-directory ,org-mode-websrc-directory
           :base-extension "org"
           :publishing-directory ,org-mode-publishing-directory
           :recursive t
           :publishing-function (org-rss-publish-to-rss)
           :html-link-home "https://www.buildfunthings.com"
           :html-link-use-abs-url t
           :exclude ".*"
           :include ("feed.org")
           )
          ("site-static"
           :base-directory       ,org-mode-websrc-directory
           :base-extension       "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|ttf\\|woff\\|woff2\\|ico\\|webmanifest"
           :publishing-directory ,org-mode-publishing-directory
           :exclude "_site"
           :recursive            t
           :publishing-function  org-publish-attachment
           )
          ))
#+end_src

*** org-reveal

ox-reveal is broken in org 9.2 due to the template mechanism change.

#+begin_src emacs-lisp
  ;; (use-package ox-reveal
  ;;   :ensure t
  ;;   :config
  ;;   (setq org-reveal-root "file:///home/arjen/Documents/BuildFunThings/Security/reveal.js-3.5.0/js/reveal.js"))
#+end_src

** Journalling

#+begin_src emacs-lisp
    (use-package org-journal
      :ensure t
      :config (setq org-journal-dir "~/Dropbox/Apps/MobileOrg/journal"))
#+end_src

