.emacs.d/loader.el

(setq mu4e-drafts-folder "/Personal/Drafts")
(setq mu4e-sent-folder   "/Personal/Sent Items")
(setq mu4e-trash-folder  "/Personal/Trash")

;; this is where the install procedure above puts your mu4e
(add-to-list 'load-path "/usr/local/Cellar/mu/1.0_1/share/emacs/site-lisp/mu/mu4e")

(require 'mu4e)

;; path to our Maildir directory
(setq mu4e-maildir "~/Maildir")

(setq mu4e-get-mail-command "mbsync -a")
(setq mu4e-view-show-images t)
(setq mu4e-html2text-command "w3m -dump -T text/html")

;; Prevent duplicate UIDs when moving files around
(setq mu4e-change-filenames-when-moving t)

;; This enables unicode chars to be used for things like flags in the message index screens.
;; I've disabled it because the font I am using doesn't support this very well. With this
;; disabled, regular ascii characters are used instead.
                                        ;(setq mu4e-use-fancy-chars t)
;; This enabled the thread like viewing of email similar to gmail's UI.
(setq mu4e-headers-include-related t)
(setq mu4e-attachment-dir  "~/Downloads")
;; This prevents saving the email to the Sent folder since gmail will do this for us on their end.
;;  (setq mu4e-sent-messages-behavior 'delete)
(setq message-kill-buffer-on-exit t)
(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types))

;; Sometimes html email is just not readable in a text based client, this lets me open the
;; email in my browser.
(add-to-list 'mu4e-view-actions '("View in browser" . mu4e-action-view-in-browser) t)

;; Spell checking ftw.
(add-hook 'mu4e-compose-mode-hook 'flyspell-mode)

;; This hook correctly modifies the \Inbox and \Starred flags on email when they are marked.
;; Without it refiling (archiving) and flagging (starring) email won't properly result in
;; the corresponding gmail action.
(add-hook 'mu4e-mark-execute-pre-hook
          (lambda (mark msg)
            (cond ((member mark '(refile trash)) (mu4e-action-retag-message msg "-\\Inbox"))
                  ((equal mark 'flag) (mu4e-action-retag-message msg "\\Starred"))
                  ((equal mark 'unflag) (mu4e-action-retag-message msg "-\\Starred")))))



(defun my-make-mu4e-context (name address signature)
  "Return a mu4e context named NAME with :match-func matching
    its ADDRESS in From or CC fields of the parent message. The
    context's `user-mail-address' is set to ADDRESS and its
    `mu4e-compose-signature' to SIGNATURE."
  (lexical-let ((addr-lex address))
    (make-mu4e-context :name name
                       :vars `((user-mail-address . ,address)
                               (mu4e-compose-signature . ,signature))
                       :match-func
                       (lambda (msg)
                         (when msg
                           (or (mu4e-message-contact-field-matches msg :to addr-lex)
                               (mu4e-message-contact-field-matches msg :cc addr-lex)))))))

(setq mu4e-contexts
      `( ,(my-make-mu4e-context "fastmail" "arjen@wiersma.org"
                                "")
         ,(my-make-mu4e-context "gmail" "arjenw@gmail.com"
                                "A very professional signature.")))

;; This is a helper to help determine which account context I am in based
;; on the folder in my maildir the email (eg. ~/.mail/nine27) is located in.
(defun mu4e-message-maildir-matches (msg rx)
  (when rx
    (if (listp rx)
        ;; If rx is a list, try each one for a match
        (or (mu4e-message-maildir-matches msg (car rx))
            (mu4e-message-maildir-matches msg (cdr rx)))
      ;; Not a list, check rx
      (string-match rx (mu4e-message-field msg :maildir)))))

;; Choose account label to feed msmtp -a option based on From header
;; in Message buffer; This function must be added to
;; message-send-mail-hook for on-the-fly change of From address before
;; sending message since message-send-mail-hook is processed right
;; before sending message.
(defun choose-msmtp-account ()
  (if (message-mail-p)
      (save-excursion
        (let*
            ((from (save-restriction
                     (message-narrow-to-headers)
                     (message-fetch-field "from")))
             (account
              (cond
               ((string-match "arjen@wiersma.org" from) "fastmail")
               ((string-match "arjenw@gmail.com" from) "gmail"))))
          (setq message-sendmail-extra-arguments (list '"-a" account))))))

;; Configure sending mail.
(setq message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program "/usr/local/bin/msmtp"
      user-full-name "Arjen Wiersma")

;; Use the correct account context when sending mail based on the from header.
(setq message-sendmail-envelope-from 'header)
(add-hook 'message-send-mail-hook 'choose-msmtp-account)

(require 'org-mu4e)

;;store link to message if in header view, not to header query
(setq org-mu4e-link-query-in-headers-mode nil)

(use-package moody
  :config
  (setq x-underline-at-descent-line t)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode))

(use-package minions
  :config (minions-mode 1))
